@joeymoore  - thanks for the fast reply. sorry i was OOO for some days - but back now.

there we go then:

main.tf
```
# Testfile for Imperva POC

variable account_id {
        type = string
}

variable cred_imp_api_id {
        type = string
}

variable cred_imp_api_secret {
        type = string
        }


## Setting up the provider for imperva incapsula
provider "incapsula" {
   api_id = var.cred_imp_api_id
   api_key = var.cred_imp_api_secret
}


terraform {
   required_version = ">= 0.12.19"
}


##### add a page plain

resource "incapsula_site" "mikes-test-page" {
  domain                 = "mikes-test-page.org"
  account_id             = var.account_id
  send_site_setup_emails = "false"
  site_ip                = "2.2.2.2"
  force_ssl              = "false"
  log_level              = "full"
}
```


Plan
```
 terraform plan -var-file=credentials.tfvars
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

incapsula_site.mikes-test-page: Refreshing state... [id=xxxxxxxx]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # incapsula_site.mikes-test-page must be replaced
-/+ resource "incapsula_site" "mikes-test-page" {
        account_id             = "XXXXX"
      ~ dns_a_record_name      = "mikes-test-page.org" -> (known after apply)
      ~ dns_a_record_value     = [
          - "45.XXXXX",
          - "45.XXXXX",
        ] -> (known after apply)
      ~ dns_cname_record_name  = "www.mikes-test-page.org" -> (known after apply)
      ~ dns_cname_record_value = "e2wkwk3.x.incapdns.net" -> (known after apply)
      ~ domain                 = "www.mikes-test-page.org" -> "mikes-test-page.org" # forces replacement
        force_ssl              = "false"
      ~ id                     = "XXXXXXX" -> (known after apply)
        log_level              = "full"
        send_site_setup_emails = "false"
      ~ site_creation_date     = 1578576812000 -> (known after apply)
        site_ip                = "2.2.2.2"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```
State List
```
terraform state list
incapsula_site.mikes-test-page
```

TF apply 
```
 terraform apply -var-file=credentials.tfvars
incapsula_site.mikes-test-page: Refreshing state... [id=xxxxx]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # incapsula_site.mikes-test-page must be replaced
-/+ resource "incapsula_site" "mikes-test-page" {
        account_id             = "xxxxxxx"
      ~ dns_a_record_name      = "mikes-test-page.org" -> (known after apply)
      ~ dns_a_record_value     = [
          - "xxxxxxx",
          - "xxxxxxx",
        ] -> (known after apply)
      ~ dns_cname_record_name  = "www.mikes-test-page.org" -> (known after apply)
      ~ dns_cname_record_value = "xxxxxx.x.incapdns.net" -> (known after apply)
      ~ domain                 = "www.mikes-test-page.org" -> "mikes-test-page.org" # forces replacement
        force_ssl              = "false"
      ~ id                     = "xxxxxxx" -> (known after apply)
        log_level              = "full"
        send_site_setup_emails = "false"
      ~ site_creation_date     = 1578576812000 -> (known after apply)
        site_ip                = "2.2.2.2"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

incapsula_site.mikes-test-page: Destroying... [id=xxxxxxxx]
incapsula_site.mikes-test-page: Destruction complete after 1s
incapsula_site.mikes-test-page: Creating...
incapsula_site.mikes-test-page: Still creating... [10s elapsed]
incapsula_site.mikes-test-page: Still creating... [20s elapsed]
incapsula_site.mikes-test-page: Still creating... [30s elapsed]
incapsula_site.mikes-test-page: Still creating... [40s elapsed]
incapsula_site.mikes-test-page: Still creating... [50s elapsed]
incapsula_site.mikes-test-page: Creation complete after 1m0s [id=xxxxxxx]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```


The above commands have been executed in the order they appear from top to down.
The state looks fine to me - at least TF has knowledge about the resources.

catting the statefile, i find it representing the active resource created.


best 
mike 
